# Задача: 1. Напишите программу, которая найдёт произведение
# пар чисел списка. Парой считаем первый и последний элемент,
# второй и предпоследний и т.д.
# Пример:
#  [2, 3, 4, 5, 6] => [12, 15, 16];
#  [2, 3, 5, 6] => [12, 15]

# Ввод
sStr = "Введите числа через пробел (например: 2 3 4 5 6): "
A = [int(x) for x in input(sStr).split()]
print(f'Произведения пар чисел списка A = {A}  =>  ', end='')
# Вычисление
B = [A[i] * A[len(A) - i - 1] for i in range((len(A)+1)//2)]
# Вывод
print(B)
